### 1.	Create a program that asks the user to enter their name and their age. Print out a message that tells them the year that they will turn 100 years old

In [5]:
Name = str(input('Enter the name:'))
Age = int(input('Enter the age:'))
if Age == 100:
    print('Congragulations you completed a century')
else:
    print('You still not completed a century')

Enter the name:Prasanth
Enter the age:21
You still not completed a century

### 2.	What is pandas groupby? Demonstrate with your own example

In [16]:
import numpy as np
import pandas as pd

In [18]:
list1 = pd.DataFrame({'Name': ['Prasanth', 'Samson', 'Raghul'], 'Age': [21, 21, 21], 'College': ['Thangavelu', 'Pachayappas', 'Madras university']})
list1

       Name  Age            College
0  Prasanth   21         Thangavelu
1    Samson   21        Pachayappas
2    Raghul   21  Madras university

In [143]:
list1.rename(columns = {'Name': 'Id', 'Age': 'Age', 'College': 'College studying'})

         Id  Age   College studying
1  Prasanth   21         Thangavelu
2    Samson   21        Pachayappas
3    Raghul   21  Madras university

### 3.	How to create a dataframe from list?

In [30]:
list2 = [['Name','Prasanth',13],['Dept','ECE',12],['Age',21]]
pd.DataFrame(list2, columns = ['column 1','column 2','column 3'])

  column 1  column 2  column 3
0     Name  Prasanth      13.0
1     Dept       ECE      12.0
2      Age        21       NaN

### 4.	What are the ways to combine the dataframe in pandas. Give an example for each

In [47]:
list1 = pd.DataFrame({'Name': ['Prasanth', 'Samson', 'Raghul'], 'Age': [21, 21, 21], 'College': ['Thangavelu', 'Pachayappas', 'Madras university']})
list2 = pd.DataFrame({'Name': ['Saran', 'Subash', 'Ram'], 'Age': [21, 21, 21], 'College': ['Thangavelu', 'Patrision', 'M.G.R university']})
concatenation = pd.concat([list1, list2])
merging = pd.merge(list1, list2, on = 'Age')
concatenation
merging

     Name_x  Age          College_x  Name_y         College_y
0  Prasanth   21         Thangavelu   Saran        Thangavelu
1  Prasanth   21         Thangavelu  Subash         Patrision
2  Prasanth   21         Thangavelu     Ram  M.G.R university
3    Samson   21        Pachayappas   Saran        Thangavelu
4    Samson   21        Pachayappas  Subash         Patrision
5    Samson   21        Pachayappas     Ram  M.G.R university
6    Raghul   21  Madras university   Saran        Thangavelu
7    Raghul   21  Madras university  Subash         Patrision
8    Raghul   21  Madras university     Ram  M.G.R university

### 5.	What is the difference between list and tuples in Python?

In [48]:
# list is mutable but tuple is immutable
# list can be assigned with[], tuple can be assigned with ()
# mostly list is used in various situations and tuple can be used in some security situations

### 6.	Find out the mean, median and standard deviation of this numpy array -> np.array([1,5,3,100,4,48])

In [67]:
array = np.array([1, 5, 3, 100, 4, 48])
a = np.mean(array)
a

26.833333333333332

In [66]:
b = np.median(array)
b

4.5

In [68]:
c = np.std(array)
c

36.59424666377065

### 7.	How will you remove duplicate elements from a list?

In [105]:
list1 = [1, 2, 3, 4, 5, 5, 6, 6, 7]

for i in range(0, len(list1)):
    for j in range(i+1, len(list1)):
        if list1[i] == list1[j]:
            print(list1[j])

5
6

### 8.	What is a map() function in Python? Give an example

In [ ]:
# Map() function can check the values for the given condition and tells it is True or False for a given condition 
# It can also operate the given condition and prints the value

In [114]:
list2 = [22, 33, 32, 45, 87, 82, 84]

new_list = list(map(lambda x: x%2 == 0, list2))
print(new_list)

[True, False, True, False, False, True, True]

### 9.	What is pass in Python?

In [129]:
# pass can be used instead of a statement under a condition if we didn't wanted to print any statement for a condition so it will not show an error

a = 10
if a%2 == 0:
    pass
else:
    print('It is odd number')

### 10.	What is vstack() in numpy? Give an example

In [137]:
# vstack() can be used to stack the array in vertical order

a = np.array([[1, 2, 3], [2, 3, 3]])
b = np.array([[8, 4, 3], [2, 5, 5]])
c = np.vstack((a, b))
c

array([[1, 2, 3],
       [2, 3, 3],
       [8, 4, 3],
       [2, 5, 5]])